import { Info, Topic } from "./TopicStyle";

const ServicesTopic = () => {

    return(
        <Info>
            <Topic>
                مِن مُنطلق تَحقيق أهدافنا سَخرنا طاقاتنا وخبراتنا
                بالتعاون المُشترك مَع فريق عَمل مُبدع لتقديم
                مَجموعة نوعية من الخدمات البرمجية والحلول
                التسويقية والتطويرية المُبتكرة التي مِن شأنها دَفع
                عجلة تطوير أعمال مُختلف المشاريع التجارية و
                الإلكترونية بما يُحقق احتياجات وتطلعات العُملاء
                المرجوة بنجاح
            </Topic>
        </Info>
    );
}

export default ServicesTopic;