import { Info, FirstTopic, Title, Topic } from "./InfoStyle";

const AboutInfo = () => {

    return(
        <Info>
            <FirstTopic>
                نحن فريق رائع ومميز من التكنولوجيا وصورة جديدة ومختلفة فالبنيان شركة تسويق الكتروني واستراتيجيات تسويقية لزيادة ضمان ربح مشروعك خلال تسليط الضوء على مشروعك لأكبر نطاق تستفيد منه بإختصار فريق عمل متكامل وكبير ومتخصص حيث أننا نمتلك أكثر من 30 موظف متخصص في مجالات مختلفة من مختلف المجالات تحت راية واحدة على أفضل خدمة للعميل شعارنا خدمات مميزة – أسعار منتجات تسويق وتطبيقات مميزة ومدروس للبقاء بقوة في السوق و تحقيق النجاح.
            </FirstTopic>
            <Title>من نحن</Title>
            <Topic>
                شركة قطرية متعددة المجالات (التجارة - المقاولات العامة -تسويق رقمي) تأسست منذ أكتر من 10 أعوام، ذات دراية تامة بالسوق القطري،تعمل  كَنموذج شراكةٍ ناجِحة مُتعددة الخبرات وعالية الإمكانيات - مُرخصة من قِبل وزارة التجارة والصناعة القطرية.  
            </Topic>
            <Topic>
                تَتمتع بخبرات واسعة وقدرات فنية رَفيِعة المستوى تؤهلها من تَقديم خَدمات برمجية وحلول تسويقية عَالية الجُودة والفعالية تُساعدِ المشاريع التِجارية على زيادة قيمة أعَمالها   وتحقيق أهدافها التسويقية بنجاح.
            </Topic>
            <Topic>
                نقدم لعملائنا مدىً مُتكاملاً من الخَدمات البرمجية والحلول التَسويقية المُبتكرة وِفِق إستراتيجية عمل دقيقة وسريعة تهدف إلى تلبية متطلبات قطاع أعمال العملاء التجارية بما يَضمن تَنمية مَشاريعهم وتحقيقِ أهدافِهم التَسويقية بِكفاءة وفعالية. 
            </Topic>
            <Topic>
                نمتلك فَريق عمل نُخبة من ذوي الكَفاءة والخبرة العالية، يَعمل على تَلبية مُتطلبات العُملاء في مُختلف القِطاعات بما يلائم احتياجاتهم وتطلعاتهم مع مُراعاة التكامل والجودة وفق المعايير الدولية.
            </Topic>
        </Info>
    );
}

export default AboutInfo;