import { Info, Title, Topic } from "./ValuesStyle";

const AboutValues = () => {

    return(
        <Info>
            <Title>قيمنا</Title>
            <Topic>
                إن قيمنا هي حجر الأساس في بناء وادارة شركتنا ومن الثوابت التي لا نحيد عنها فهي التي تحدد ماهيتنا وجميع اتجاهاتنا ليس فقط مع عملائنا، بل مع موظفينا ومجتمعنا أيضاً.             
            </Topic>
            <Topic> -
                الجودة: كوننا دؤوبين في صنع نموذج ناجح نضع معايير الجودة الدولية في كل سطر من صفحات أعمالنا بما يحقق القيمة
                المضافة لعملائنا.
            </Topic>
            <Topic> -
                المرونة: تسري المرونة والقدرة على التكيف والسعي وراء الابتكار في جنبات شركتنا ما يعزز من قدرتنا على التميز وخلق 
                الفرص وتطوير الحلول التقنية والخدمية بنظرةٍ مستقبلية.
            </Topic>
            <Topic> -
                الدقة في الأداء: إن جرأتنا على تحدي الوضع الراهن يدفعنا للعمل بأعلى مستوى من الدقة والاحتراف لإحداث تحولٍ مستدام
                يترك بصمةً إيجابية على أعمال جميع الأشخاص المرتبطين بأعمالنا.
            </Topic>
            <Topic> -
                الاحترام: لأننا نعيش في بيئة متعددة الثقافات تدور حول الاحترام المتبادل، نعمل على تعزيز الثقة والصدق في جميع التعاملات.
            </Topic>
            <Topic> -
                النزاهة: لأننا نسعى لفعل الشيء الصحيح في الطريق الصحيح، نقوم باتخاذ قرارات وإجراءات أعمالنا في إطار من القيم الأخلاقية
                والاعتبارات القانونية.
            </Topic>
            <Topic> -
                الالتزام: إننا نتعهد بالوفاء بالتزاماتنا تجاه عملائنا، وتحمل مسؤولية أفعالنا.
            </Topic>
        </Info>
    );
}

export default AboutValues;