import { Container, Title, Info, Topic, SubTitle, Anchor } from "./WebStyle";
import Head from "../../../../Sections/MainSections/Header/Header";

const Web = () => {

    return(
        <Container>
            <Head title={"برمجة المواقع والتطبيقات"} />
            <Info>
                <Title>برمجة المواقع</Title>
                <Topic>
                    نعمل على تقديم خدمات برمجية متعددة في مختلف المجالات لأصحاب الشركات والمواقع الإلكترونية على أعلى مستوى
                    من الدقة والاحترافية، تتضمن:
                </Topic>
                <SubTitle>- إنشاء صفحة ويب بلغة HTML</SubTitle>
                <Topic>
                    تعد برمجة صفحة ويب بهذه  اللغة الأكثر انتشارا بين مطوري المواقع الإلكترونية لأنها من أفضل لغات البرمجة البسيطة في انشاء الصفحات بكل سهولة، وأوسعها استخداما في هيكلة وتصميم صفحات الويب، وتعطي متصفح الإنترنت وصفاً لكيفية عرض المحتويات.
                </Topic>
                <SubTitle>- تصميم صفحة ويب بلغة PHP</SubTitle>
                <Topic>
                    لإنشاء موقع ويب بهذه  اللغة لأي نشاط تجارى لتيسير الأعمال وعرض محتوى الخدمات بكل سهولة، بنظام حديث يتناسب مع كافة المتصفحات والأجهزة الذكية.
                </Topic>
                <SubTitle>- مشاريع جافاسكربت</SubTitle>
                <Topic>
                    تعتبر مشاريع جافا سكريبت لغة عالية المستوى والأكثر استخدام في العالم في تقديم الخدمات وتطوير المواقع ومتصفحات الويب لإنشاء صفحات أكثر تفاعلية.
                </Topic>
                <SubTitle>- التطوير باستخدام أكواد بايثون</SubTitle>
                <Topic>
                    تعتبر لغة بايثون لغة برمجة نصية شائعة الاستخدام للأغراض العامة وهي مناسبة بشكل خاص لتطوير الويب. سريعة ومرنة وعملية، تدعم كل شيء من مدونتك إلى مواقع الويب الأكثر شهرة في العالم. 
                </Topic>
            </Info>
            <Info>
                <Title>برمجة تطبيقات الجوال</Title>
                <Topic>
                    نستطيع برمجة تطبيقات الجوال فلدينا فريق عمل متخصص فى تصميم الاجهزة الذكية في خدمتك مكون من المطورين
                    المحترفين.
                </Topic>
                <SubTitle>- تطبيقات الاندرويد</SubTitle>
                <Topic>
                    صناعة التطبيقات للأندرويد بكل احترافية لتخدم أهدافك المطلوبة وتجذب عملائك وجمهورك المُستهدف.
                </Topic>
                <SubTitle>- انشئ تطبيقك الالكتروني</SubTitle>
                <Topic>
                    نعمل علي انشاء تطبيقك الالكتروني لتصل لعملائك بأسرع واسهل طريقة بمدة زمنية قصيرة    وبأسعار منافسة.
                </Topic>
                <SubTitle>- حلول ذكية</SubTitle>
                <Topic>
                    نساعدك على تحويل فكرتك الى تطبيق ناجح بلوحة تحكم سهلة باستخدام أفضل التقنيات الحديثة.
                </Topic>
            </Info>
            <Anchor>أطلب عرض سعر</Anchor>
        </Container>
    );
}

export default Web;