import { Container, Info, Title, SubTitle, Topic } from "./MarketingStyle";


const Market = () => {

    return(
        <Container>
            <Info>
                <Title>برمجة المواقع</Title>
                <Topic>
                    نعمل على تقديم خدمات برمجية متعددة في مختلف المجالات لأصحاب الشركات والمواقع الإلكترونية على أعلى مستوى
                    من الدقة والاحترافية، تتضمن:
                </Topic>
                <SubTitle>- إنشاء صفحة ويب بلغة HTML</SubTitle>
                <Topic>
                    تعد برمجة صفحة ويب بهذه  اللغة الأكثر انتشارا بين مطوري المواقع الإلكترونية لأنها من أفضل لغات البرمجة البسيطة في انشاء الصفحات بكل سهولة، وأوسعها استخداما في هيكلة وتصميم صفحات الويب، وتعطي متصفح الإنترنت وصفاً لكيفية عرض المحتويات.
                </Topic>
                <SubTitle>- تصميم صفحة ويب بلغة PHP</SubTitle>
                <Topic>
                    لإنشاء موقع ويب بهذه  اللغة لأي نشاط تجارى لتيسير الأعمال وعرض محتوى الخدمات بكل سهولة، بنظام حديث يتناسب مع كافة المتصفحات والأجهزة الذكية.
                </Topic>
                <SubTitle>- مشاريع جافاسكربت</SubTitle>
                <Topic>
                    تعتبر مشاريع جافا سكريبت لغة عالية المستوى والأكثر استخدام في العالم في تقديم الخدمات وتطوير المواقع ومتصفحات الويب لإنشاء صفحات أكثر تفاعلية.
                </Topic>
                <SubTitle>- التطوير باستخدام أكواد بايثون</SubTitle>
                <Topic>
                    تعتبر لغة بايثون لغة برمجة نصية شائعة الاستخدام للأغراض العامة وهي مناسبة بشكل خاص لتطوير الويب. سريعة ومرنة وعملية، تدعم كل شيء من مدونتك إلى مواقع الويب الأكثر شهرة في العالم. 
                </Topic>
            </Info>
        </Container>
    );
}

export default Market;