import Head from "../../../../Sections/MainSections/Header/Header";
import { Container, Info, Topic, SubTopic, Title } from "./PolicyStyle";

const Policy = () => {

    return(
        <Container>
            <Head title={"سياسة الخصوصية"} />
            <Info>
                <Topic>
                    في عن هندسة البنيان للتسويق الرقمي، إحدى أولوياتنا الرئيسية هي خصوصية زوارنا. تحتوي وثيقة سياسة الخصوصية هذه
                    على أنواع المعلومات التي يتم جمعها وتسجيلها بواسطة هندسة البنيان وكيفية استخدامها.
                </Topic>
                <Topic>
                    إذا كانت لديك أسئلة إضافية أو تحتاج إلى مزيد من المعلومات حول سياسة الخصوصية الخاصة بنا، فلا تتردد في الاتصال بنا.
                </Topic>
                <Topic> 
                    تنطبق سياسة الخصوصية هذه فقط على أنشطتنا عبر الإنترنت وهي صالحة لزوار موقعنا الإلكتروني فيما يتعلق بالمعلومات
                    التي شاركوها و/أو يجمعونها في هندسة البنيان، لا تنطبق هذه السياسة على أي معلومات يتم جمعها في وضع عدم الاتصال
                    أو عبر قنوات أخرى غير هذا الموقع.
                </Topic>
            </Info>
            <Info>
                <Title>موافقة</Title>
                <Topic>
                    باستخدام موقعنا، فإنك بذلك توافق على سياسة الخصوصية الخاصة بنا وتوافق على شروطها.              
                </Topic>
            </Info>
            <Info>
                <Title>المعلومات التي نجمعها</Title>
                <Topic>
                    سيتم توضيح المعلومات الشخصية التي يُطلب منك تقديمها، وأسباب مطالبتك بتقديمها، في الوقت الذي نطلب منك فيه
                    تقديم معلوماتك الشخصية.
                </Topic>
                <Topic>
                    إذا اتصلت بنا مباشرة، فقد نتلقى معلومات إضافية عنك مثل اسمك وعنوان بريدك الإلكتروني ورقم هاتفك ومحتويات الرسالة
                    و/أو المرفقات التي قد ترسلها إلينا وأي معلومات أخرى قد تختار تقديمها.
                </Topic>
                <Topic>
                    عند التسجيل للحصول على حساب، قد نطلب معلومات الاتصال الخاصة بك، بما في ذلك عناصر مثل الاسم واسم الشركة والعنوان وعنوان البريد الإلكتروني ورقم الهاتف.
                </Topic>
            </Info>
            <Info>
                <Title>كيف نستخدم معلوماتك</Title>
                <Topic>
                    نستخدم المعلومات التي نجمعها بطرق مختلفة، بما في ذلك:         
                </Topic>
                <SubTopic> -
                    توفير وتشغيل وصيانة موقعنا.
                </SubTopic>
                <SubTopic> -
                    تحسين وتخصيص وتوسيع موقعنا.      
                </SubTopic>
                <SubTopic> -
                    فهم وتحليل كيفية استخدامك لموقعنا.              
                </SubTopic>
                <SubTopic> -
                    تطوير منتجات وخدمات وميزات ووظائف جديدة.
                </SubTopic>
                <SubTopic> -
                    التواصل معك، إما بشكل مباشر أو من خلال أحد شركائنا، بما في ذلك لخدمة العملاء
                    لتزويدك بالتحديثات والمعلومات الأخرى المتعلقة بالموقع ولأغراض تسويقية وترويجية.           
                </SubTopic>
                <SubTopic> -
                    ارسال رسائل البريد الإلكتروني إليك.      
                </SubTopic>
                <SubTopic> -
                    البحث عن الاحتيال ومنعه.               
                </SubTopic>
            </Info>
            <Info>
                <Title>ملفات الدخول</Title>
                <Topic>
                    تتبع هندسة البنيان إجراءً قياسيًا لاستخدام ملفات السجل. تسجل هذه الملفات الزوار عندما يزورون مواقع الويب. تقوم
                    جميع شركات الاستضافة بذلك حيث تعتبرُ جزءًا من تحليلات خدمات الاستضافة. تتضمن المعلومات التي يتم جمعها بواسطة
                    ، وختم التاريخ، والوقت، وصفحات (ISP)، ونوع المستعرض، وموفر خدمة الإنترنت (IP)ملفات السجل: عناوين بروتوكول الإنترنت
                    .الإحالة/الخروج، وعدد النقرات. تجدر الإشارة إلى أن هذه البيانات ليست مرتبطة بأي معلومات متعلقة بتحديد الهوية الشخصية
                    .الغرض من المعلومات هو تحليل الاتجاهات وإدارة الموقع وتتبع حركة المستخدمين على الموقع وجمع المعلومات الديموغرافية.          
                </Topic>
            </Info>
            <Info>
                <Title>ملفات تعريف الارتباط وإشارات الويب</Title>
                <Topic>
                    .مثل أي موقع ويب آخر، تستخدم هندسة البنيان “ملفات تعريف الارتباط”. تُستخدم ملفات تعريف الارتباط هذه لتخزين
                    المعلومات بما في ذلك تفضيلات الزوار والصفحات الموجودة على موقع الويب التي وصل إليها الزائر أو زارها. تُستخدم
                    المعلومات لتحسين تجربة المستخدمين من خلال تخصيص محتوى صفحة الويب الخاصة بنا بناءً على نوع تصفح الزوار و
                    /أو معلومات أخرى.
                </Topic>
            </Info>
            <Info>
                <Title>سياسات خصوصية شركاء الإعلانات</Title>
                <Topic>
                    يمكنك الرجوع إلى هذه القائمة للعثور على سياسة الخصوصية لكل من شركاء الإعلان في هندسة البنيان.
                </Topic>
                <Topic>
                    تستخدم خوادم الإعلانات الخارجية أو شبكات الإعلانات تقنيات مثل ملفات تعريف الارتباط أو جافا سكريبت أو منارات الويب
                    المستخدمة في الإعلانات والروابط الخاصة بكل منها والتي تظهر على هندسة البنيان، والتي يتم إرسالها مباشرة إلى متصفح
                    الخاص بك تلقائيًا عند حدوث ذلك. تُستخدم هذه التقنيات لقياس فعالية حملاتهم الإعلانية و/أو IP المستخدمين. يتلقون عنوان
                    لتخصيص محتوى الإعلان الذي تراه على مواقع الويب التي تزورها.
                </Topic>
                <Topic>
                    لاحظ أن هندسة البنيان ليس لها حق الوصول أو التحكم في ملفات تعريف الارتباط هذه التي  يستخدمها معلنون تابعون
                    لجهات خارجية.
                </Topic>
            </Info>
            <Info>
                <Title>سياسات خصوصية الطرف الثالث</Title>
                <Topic>
                    يمكنك الرجوع إلى هذه القائمة للعثور على سياسة الخصوصية لكل من شركاء الإعلان في هندسة البنيان بالرجوع إلى سياسات الخصوصية الخاصة بخوادم إعلانات الجهات الخارجية للحصول على معلومات أكثر تفصيلاً. قد يتضمن ممارساتهم وتعليماتهم
                    حول كيفية الانسحاب من بعض الخيارات.
                </Topic>
                <Topic>
                    يمكنك اختيار تعطيل ملفات تعريف الارتباط من خلال خيارات المتصفح الخاص بك. لمعرفة المزيد من يمكنك اختيار تعطيل ملفات
                    تعريف الارتباط من خلال خيارات المتصفح الخاص بك. لمعرفة المزيد من مواقع الويب الخاصة بالمتصفحات.
                </Topic>
            </Info>
            <Info>
                <Title>لا تبيع معلوماتي الشخصية (CCPA) حقوق خصوصية</Title>
                <Topic>
                    بموجب CCPA، من بين حقوق أخرى يحق للسمتهلكين في كاليفورنيا:
                </Topic>
                <SubTopic> -
                    اطلب أن تكشف الشركة التي تجمع البيانات الشخصية للمستهلك عن فئات وأجزاء معينة من البيانات الشخصية التي جمعتها
                    الشركة عن المستهلكين.          
                </SubTopic>
                <SubTopic> -
                    اطلب من شركة ما حذف أي بيانات شخصية عن المستهلك جمعتها الشركة.
                </SubTopic>
                <SubTopic> -
                    اطلب من الشركة التي تبيع البيانات الشخصية للمستهلك، ألا تبيع البيانات الشخصية للمستهلك.
                </SubTopic>
                <SubTopic> -
                    إذا قمت بتقديم طلب، فلدينا شهر واحد للرد عليك. إذا كنت ترغب في ممارسة أي من هذه الحقوق، يرجى الاتصال بنا.              
                </SubTopic>
            </Info>
            <Info>
                <Title>حقوق حماية بيانات(CCPA)</Title>
                <Topic>
                    نود التأكد من أنك على دراية كاملة بجميع حقوق حماية البيانات الخاصة بك. يحق لكل مستخدم ما يلي:               
                </Topic>
                <SubTopic> -
                    الحق في الوصول: يحق لك طلب نسخ من بياناتك الشخصية. قد نفرض عليك رسومًا رمزية مقابل هذه الخدمة.
                </SubTopic>
                <SubTopic> -
                    الحق في التصحيح : يحق لك أن تطلب منا تصحيح أي معلومات تعتقد أنها غير دقيقة. لديك أيضًا الحق في طلب إكمال
                    المعلومات التي تعتقد أنها غير كاملة.
                </SubTopic>
                <SubTopic> -
                    الحق في المسح: يحق لك طلب مسح بياناتك الشخصية، في ظل ظروف معينة.
                </SubTopic>
                <SubTopic> -
                    الحق في تقييد المعالجة: يحق لك طلب تقييد معالجة بياناتك الشخصية، في ظل ظروف معينة.
                </SubTopic>
                <SubTopic> -
                    الحق في الاعتراض على المعالجة: يحق لك الاعتراض على معالجتنا لبياناتك الشخصية، في ظل ظروف معينة.
                </SubTopic>
                <SubTopic> -
                    الحق في نقل البيانات : يحق لك أن تطلب منا نقل البيانات التي جمعناها إلى مؤسسة أخرى، أو إليك
                    مباشرةً، في ظل ظروف معينة.
                </SubTopic>
                <Topic>
                    إذا قمت بتقديم طلب، فلدينا شهر واحد للرد عليك. إذا كنت ترغب في ممارسة أي من هذه الحقوق، يرجى الاتصال بنا.              
                </Topic>
            </Info>
            <Info>
                <Title>معلومات الأطفال</Title>
                <Topic>
                    جزء آخر من أولوياتنا هو إضافة الحماية للأطفال أثناء استخدام الإنترنت. نشجع الآباء والأوصياء على مراقبة نشاطهم عبر الإنترنت
                    والمشاركة فيه و/أو مراقبته وتوجيهه.
                </Topic>
                <Topic>
                    لا تجمع هندسة البنيان عن قصد أي معلومات تعريف شخصية من الأطفال دون سن 13 عامًا. إذا كنت تعتقد أن طفلك قدم هذا
                    النوع من المعلومات على موقعنا، فنحن نشجعك بشدة على الاتصال بنا على الفور وسنبذل قصارى جهدنا للإزالة على الفور هذه
                    المعلومات من سجلاتنا.
                </Topic>
            </Info>
            <Info>
                <Title>التعديلات على سياسة سرية وخصوصية المعلومات</Title>
                <Topic>
                    تحتفظ هندسة البنيان بالحق في تعديل بنود وشروط سياسة سرية وخصوصية المعلومات إن لزم الأمر ومتى كان ذلك ملائماً
                    سيتم تنفيذ التعديلات هنا او على صفحة سياسة الخصوصية الرئيسية وسيتم بصفة مستمرة إخطارك بالبيانات التي حصلنا
                    عليها، وكيف سنستخدمها والجهة التي سنقوم بتزويدها بهذه البيانات.
                </Topic>
            </Info>
            <Info>
                <Title>ختاماً</Title>
                <Topic>
                    إن مخاوفك واهتمامك بشأن سرية وخصوصية البيانات تعتبر مسألة في غاية الأهمية بالنسبة لنا. نحن نأمل أن يتم تحقيق ذلك
                    من خلال هذه السياسة.
                </Topic>
            </Info>
        </Container>
    );
}

export default Policy;