import { Info, Title, Topic } from "./AimsStyle";

const AboutAims = () => {

    return(
        <Info>
            <Title>أهدافنا</Title>
            <Topic>
                تكمن الثروة الحقيقية للشركة في بناء عِلاقات مَتينة مع العملاء لذلك نحرص منذ الوهلة الأولى على العمل بسياسة “الجودة
               أولاً” واتباع أعلى المعايير التي تؤهلنا في تحقيق نقلة نوعية لأعمال عملائنا الالكترونية باتباع الأهداف التالية:
            </Topic>
            <Topic> -
                لان العميل بؤرة اهتمامنا وشريك نَجاحتنا نحرص على الاستمرار في تقديم جميع خدماتنا بجودةٍ عالية الإتقان والاحترافية و
               بأقل التكاليف الممكنة.
            </Topic>
            <Topic> -
                الاستمرار في رفع كفاءة فريق العمل وتطوير قدراتهم لتواكب متطلبات العملاء وتنافس قدرات الآخرين وتتفوق عليها.
            </Topic>
            <Topic> -
            الالتزام بالوقت المحدد في إنجاز المهام وتسليمها على أكمل وجه.
            </Topic>
        </Info>
    );
}

export default AboutAims;